# RebarContainer Methods (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
RebarContainer Methods
RebarContainer Class See Also
---
The RebarContainer type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AppendItemFromCurves | Appends an Item to the RebarContainer. Fills its data on base of the Rebar. |
| AppendItemFromCurvesAndShape | Appends an Item to the RebarContainer. Fills its data on base of the Rebar. |
| AppendItemFromRebar | Appends an Item to the RebarContainer. Fills its data on base of the Rebar. Will throw exception if given rebar is not shape driven. Will throw exception if given rebar has moved bars in set. |
| AppendItemFromRebarShape | Appends an Item to the RebarContainer. Fills its data on base of the Rebar. |
| ArePhasesModifiable | Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.  (Inherited from Element.) |
| CanApplyPresentationMode | Checks if a presentation mode can be applied for this RebarContainer in the given view. |
| CanBeHidden | Indicates if the element can be hidden in the view. (Inherited from Element.) |
| CanBeLocked | Identifies if the element can be locked.  (Inherited from Element.) |
| CanDeleteSubelement | Checks if given subelement can be removed from the element.  (Inherited from Element.) |
| CanHaveTypeAssigned()()()() | Identifies if the element can have a type assigned.  (Inherited from Element.) |
| ChangeTypeId(ElementId) | Changes the type of the element.  (Inherited from Element.) |
| ClearItems | Clears all the Items stored in this Rebar Container element. |
| Contains | Checks if the RebarContainer has this item as one of its members. |
| Create | Creates a new instance of a Rebar Container element within the project. |
| DeleteEntity | Deletes the existing entity created by %schema% in the element  (Inherited from Element.) |
| DeleteSubelement | Removes a subelement from the element.  (Inherited from Element.) |
| DeleteSubelements | Removes the subelements from the element.  (Inherited from Element.) |
| Dispose | (Inherited from Element.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
| GetDependentElements | Get all elements that, from a logical point of view, are the children of this Element.  (Inherited from Element.) |
| GetEntity | Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.  (Inherited from Element.) |
| GetEntitySchemaGuids | Returns the Schema guids of any Entities stored in this element.  (Inherited from Element.) |
| GetEnumerator | Returns an enumerator that iterates through a collection. |
| GetExternalFileReference | Gets information pertaining to the external file referenced by the element.  (Inherited from Element.) |
| GetExternalResourceReference | Gets the ExternalResourceReference associated with a specified external resource type.  (Inherited from Element.) |
| GetExternalResourceReferenceExpanded | Gets the collection of ExternalResourceReference associated with a specified external resource type.  (Inherited from Element.) |
| GetExternalResourceReferences | Gets the map of the external resource references referenced by the element.  (Inherited from Element.) |
| GetExternalResourceReferencesExpanded | Gets the expanded map of the external resource references referenced by the element.  (Inherited from Element.) |
| GetGeneratingElementIds | Returns the ids of the element(s) that generated the input geometry object.  (Inherited from Element.) |
| GetGeometryObjectFromReference | Retrieve one geometric primitive contained in the element given a reference.  (Inherited from Element.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetHostId | The element that contains the rebar. |
| GetItem | Gets the item stored in the RebarContainer at the associated index. |
| GetMaterialArea | Gets the area of the material with the given id.  (Inherited from Element.) |
| GetMaterialIds | Gets the element ids of all materials present in the element.  (Inherited from Element.) |
| GetMaterialVolume | Gets the volume of the material with the given id.  (Inherited from Element.) |
| GetMonitoredLinkElementIds | Provides the link instance IDs when the element is monitoring.  (Inherited from Element.) |
| GetMonitoredLocalElementIds | Provides the local element IDs when the element is monitoring.  (Inherited from Element.) |
| GetOrderedParameters | Gets the parameters associated to the element in order.  (Inherited from Element.) |
| GetParameter | Retrieves a parameter from the element given identifier. (Inherited from Element.) |
| GetParameterFormatOptions | Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.  (Inherited from Element.) |
| GetParameters | Retrieves the parameters from the element via the given name. (Inherited from Element.) |
| GetParametersManager | Returns an object used to manage parameters of the Rebar Container. |
| GetPhaseStatus | Gets the status of a given element in the input phase  (Inherited from Element.) |
| GetRebarContainerIterator | Returns a Rebar Container Iterator that iterates through the Rebar Container Items. |
| GetReinforcementRoundingManager | Returns an object for managing reinforcement rounding override settings. |
| GetSubelements | Returns the collection of element subelements.  (Inherited from Element.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetTypeId | Returns the identifier of this element's type.  (Inherited from Element.) |
| GetValidTypes()()()() | Obtains a set of types that are valid for this element.  (Inherited from Element.) |
| HasPhases | Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.  (Inherited from Element.) |
| HasPresentationOverrides | Identifies if any RebarContainerItem of this RebarContainer has overridden default presentation settings for the given view. |
| IsCreatedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order.  (Inherited from Element.) |
| IsDemolishedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order.  (Inherited from Element.) |
| IsExternalFileReference | Determines whether this Element represents an external file.  (Inherited from Element.) |
| IsHidden | Identifies if the element has been permanently hidden in the view. (Inherited from Element.) |
| IsItemHidden | Identifies if a given RebarContainerItem is hidden in this view. |
| IsMonitoringLinkElement | Indicate whether an element is monitoring any elements in any linked models.  (Inherited from Element.) |
| IsMonitoringLocalElement | Indicate whether an element is monitoring other local elements.  (Inherited from Element.) |
| IsPhaseCreatedValid | Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.  (Inherited from Element.) |
| IsPhaseDemolishedValid | Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.  (Inherited from Element.) |
| IsSolidInView | **Obsolete.** Checks if this RebarContainer element is shown as solid in the given 3D view. |
| IsUnobscuredInView | Checks if this rebar container element is shown unobscured in a view. |
| IsValidType(ElementId) | Checks if given type is valid for this element.  (Inherited from Element.) |
| LookupParameter | Attempts to find a parameter on the element which has the given name. (Inherited from Element.) |
| RefersToExternalResourceReference | Determines whether this Element uses external resources associated with a specified external resource type.  (Inherited from Element.) |
| RefersToExternalResourceReferences | Determines whether this Element uses external resources.  (Inherited from Element.) |
| RemoveItem | Removes Item from the Rebar Container. |
| SetEntity | Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.  (Inherited from Element.) |
| SetHostId | The element that contains the rebar. |
| SetItemHiddenStatus | Sets the RebarContainerItem to be hidden or unhidden in the given view. |
| SetSolidInView | **Obsolete.** Sets this RebarContainer element is shown as solid in the given 3D view. |
| SetUnobscuredInView | Sets this rebar container element to be shown unobscured in a view. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace